In [2]:
import numpy as np 
import pandas as pd

In [17]:
mydataset = {
  "cars": ["BMW", "Volvo", "Ford"],
  "passings": [3, 7, 2],
  "price":[100,300,400]
  
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings  price
0    BMW         3    100
1  Volvo         7    300
2   Ford         2    400

In [18]:
a = [1, 7, 2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [20]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)
print(myvar["y"])

x    1
y    7
z    2
dtype: int64
7

In [21]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [30]:
import pandas as pd
data = {
  "calories": [ 500 , 380, 390],
  "duration": [50, 40, 30 ]     
}
df = pd.DataFrame(data, index = ["sunday", "monday", "thursday"])
print(df) 
df.info()

          calories  duration
sunday         500        50
monday         380        40
thursday       390        30
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, sunday to thursday
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   duration  3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

In [35]:
df.isnull()
df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, sunday to thursday
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   calories  3 non-null      int64
 1   duration  3 non-null      int64
dtypes: int64(2)
memory usage: 72.0+ bytes

In [43]:
import os
os.getcwd()

'C:\\Users\\akash\\OneDrive\\Desktop\\Jupyter Notebook\\All Python Program Files'

In [51]:
!pip install openpyxl
import numpy as np
import pandas as pd 
df=pd.read_excel("Hiring Process.xlsx")

Requirement already satisfied: openpyxl in c:\users\akash\appdata\local\programs\python\python312\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\akash\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [50]:
print(df)

      application_id  Interview Taken on    Status event_name  \
0             383422 2014-05-01 11:40:49     Hired       Male
1             907518 2014-05-06 08:08:32     Hired     Female
2             176719 2014-05-06 08:08:54  Rejected       Male
3             429799 2014-05-02 16:28:59  Rejected     Female
4             253651 2014-05-02 16:32:26     Hired       Male
...              ...                 ...       ...        ...
7163          493131 2014-08-28 17:32:33     Hired       Male
7164          214261 2014-08-31 01:36:21     Hired     Female
7165          932441 2014-08-31 01:37:59     Hired       Male
7166           39010 2014-08-31 01:38:23  Rejected       Male
7167          686055 2014-08-26 12:14:53     Hired       Male

                 Department Post Name  Offered Salary
0        Service Department        c8         56553.0
1        Service Department        c5         22075.0
2        Service Department        c5         70069.0
3     Operations Department        i4          3207.0
4     Operations Department        i4         29668.0
...                     ...       ...             ...
7163     Service Department        c9         49282.0
7164     Service Department        c5         57742.0
7165     Service Department        c5         69932.0
7166     Service Department        c5         14489.0
7167  Operations Department        c5         54201.0

[7168 rows x 7 columns]

In [52]:
df=pd.read_excel("Hiring Process.xlsx")
print(df)

      application_id    Status event_name  Department  Unnamed: 4 Unnamed: 5
0             383422     Hired       Male     Service         NaN        NaN
1             907518     Hired     Female     Service         NaN        NaN
2             176719  Rejected       Male     Service         NaN        NaN
3             429799  Rejected     Female  Operations         NaN        NaN
4             253651     Hired       Male  Operations         NaN        NaN
...              ...       ...        ...         ...         ...        ...
7163          493131     Hired       Male     Service         NaN        NaN
7164          214261     Hired     Female     Service         NaN        NaN
7165          932441     Hired       Male     Service         NaN        NaN
7166           39010  Rejected       Male     Service         NaN        NaN
7167          686055     Hired       Male  Operations         NaN        NaN

[7168 rows x 6 columns]

In [53]:
new_df = df.dropna()
print(new_df.to_string())

Empty DataFrame
Columns: [application_id, Status, event_name, Department, Unnamed: 4, Unnamed: 5]
Index: []

In [54]:
df

      application_id    Status event_name  Department  Unnamed: 4 Unnamed: 5
0             383422     Hired       Male     Service         NaN        NaN
1             907518     Hired     Female     Service         NaN        NaN
2             176719  Rejected       Male     Service         NaN        NaN
3             429799  Rejected     Female  Operations         NaN        NaN
4             253651     Hired       Male  Operations         NaN        NaN
...              ...       ...        ...         ...         ...        ...
7163          493131     Hired       Male     Service         NaN        NaN
7164          214261     Hired     Female     Service         NaN        NaN
7165          932441     Hired       Male     Service         NaN        NaN
7166           39010  Rejected       Male     Service         NaN        NaN
7167          686055     Hired       Male  Operations         NaN        NaN

[7168 rows x 6 columns]

In [57]:
a=df.isnull().sum()

In [58]:
a

application_id       0
Status               0
event_name           0
Department           0
Unnamed: 4        7168
Unnamed: 5        7071
dtype: int64

In [59]:

df.fillna(130)

      application_id    Status event_name  Department  Unnamed: 4 Unnamed: 5
0             383422     Hired       Male     Service       130.0        130
1             907518     Hired     Female     Service       130.0        130
2             176719  Rejected       Male     Service       130.0        130
3             429799  Rejected     Female  Operations       130.0        130
4             253651     Hired       Male  Operations       130.0        130
...              ...       ...        ...         ...         ...        ...
7163          493131     Hired       Male     Service       130.0        130
7164          214261     Hired     Female     Service       130.0        130
7165          932441     Hired       Male     Service       130.0        130
7166           39010  Rejected       Male     Service       130.0        130
7167          686055     Hired       Male  Operations       130.0        130

[7168 rows x 6 columns]

In [60]:
df

      application_id    Status event_name  Department  Unnamed: 4 Unnamed: 5
0             383422     Hired       Male     Service         NaN        NaN
1             907518     Hired     Female     Service         NaN        NaN
2             176719  Rejected       Male     Service         NaN        NaN
3             429799  Rejected     Female  Operations         NaN        NaN
4             253651     Hired       Male  Operations         NaN        NaN
...              ...       ...        ...         ...         ...        ...
7163          493131     Hired       Male     Service         NaN        NaN
7164          214261     Hired     Female     Service         NaN        NaN
7165          932441     Hired       Male     Service         NaN        NaN
7166           39010  Rejected       Male     Service         NaN        NaN
7167          686055     Hired       Male  Operations         NaN        NaN

[7168 rows x 6 columns]

In [ ]:
df